In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
dataset1 = pd.DataFrame({"col1": np.random.randn(1000), "col2": np.random.rand(1000)})

In [3]:
dataset1

         col1      col2
0    0.107465  0.688100
1    1.164201  0.724747
2   -1.980472  0.005184
3    0.360963  0.467904
4    0.535463  0.672896
..        ...       ...
995 -0.028554  0.166657
996  0.842849  0.597556
997  0.854545  0.486177
998  0.898656  0.377624
999 -0.575662  0.707342

[1000 rows x 2 columns]

In [10]:
col1Cut = pd.cut(dataset1.col1,4)
col2Cut = pd.qcut(dataset1.col1,4)

In [11]:
col1Cut

0       (-0.295, 1.576]
1       (-0.295, 1.576]
2      (-2.167, -0.295]
3       (-0.295, 1.576]
4       (-0.295, 1.576]
             ...
995     (-0.295, 1.576]
996     (-0.295, 1.576]
997     (-0.295, 1.576]
998     (-0.295, 1.576]
999    (-2.167, -0.295]
Name: col1, Length: 1000, dtype: category
Categories (4, interval[float64]): [(-4.045, -2.167] < (-2.167, -0.295] < (-0.295, 1.576] < (1.576, 3.447]]

In [12]:
datasetR = dataset1.groupby(col1Cut)

In [13]:
datasetR.count()

                  col1  col2
col1
(-4.045, -2.167]    16    16
(-2.167, -0.295]   362   362
(-0.295, 1.576]    566   566
(1.576, 3.447]      56    56

In [14]:
col2Cut

0                  (-0.00841, 0.55]
1                     (0.55, 3.447]
2      (-4.039000000000001, -0.645]
3                  (-0.00841, 0.55]
4                  (-0.00841, 0.55]
                   ...
995              (-0.645, -0.00841]
996                   (0.55, 3.447]
997                   (0.55, 3.447]
998                   (0.55, 3.447]
999              (-0.645, -0.00841]
Name: col1, Length: 1000, dtype: category
Categories (4, interval[float64]): [(-4.039000000000001, -0.645] < (-0.645, -0.00841] < (-0.00841, 0.55] < (0.55, 3.447]]

In [15]:
datasetW = dataset1.groupby(col2Cut)

In [17]:
datasetW.count()

                              col1  col2
col1
(-4.039000000000001, -0.645]   250   250
(-0.645, -0.00841]             250   250
(-0.00841, 0.55]               250   250
(0.55, 3.447]                  250   250

Quindi abbiamo capito che il cut rende le larghezze degli intervalli uguali, mentre il qcut rende il numero degli elementi negli intervalli uguali